<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"f305a4311b3a02d748f40444b4628ec855af1e39e7d39de42253536e5c96593b","plan_job_ref":"Job Test actions using target and replace #454 at https://github.com/dflook/terraform-github-actions/actions/runs/12936377718","plan_out_hash":"3abe6c048e29d2736a566908cd83840f64d990619b66aacb362f7a78504736fc","plan_hash":"058ef8924026d76b3b4e67a07f85264215c7296f623b68fd83344247004f5422","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "A9Uh4FCvIk" -> (known after apply)
!~  foreach = "xiLtqTBaNe" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #454](https://github.com/dflook/terraform-github-actions/actions/runs/12936377718)